ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/psoc6a256k.h
/*******************************************************************************
*                                     CTBM
*******************************************************************************/

#define CTBM0_BASE                              0x40900000UL
#define CTBM0                                   ((CTBM_Type*) CTBM0_BASE)                                         /* 0x40900000 */

/*******************************************************************************
*                                     SAR
*******************************************************************************/

#define SAR0_BASE                               0x409D0000UL
#define SAR1_BASE                               0x409E0000UL
#define SAR0                                    ((SAR_Type*) SAR0_BASE)                                           /* 0x409D0000 */
#define SAR1                                    ((SAR_Type*) SAR1_BASE)                                           /* 0x409E0000 */

/*******************************************************************************
*                                     PASS
*******************************************************************************/

#define PASS_BASE                               0x409F0000UL
#define PASS                                    ((PASS_Type*) PASS_BASE)                                          /* 0x409F0000 */
#define PASS_TIMER                              ((PASS_TIMER_Type*) &PASS->TIMER)                                 /* 0x409F0100 */
#define PASS_LPOSC                              ((PASS_LPOSC_Type*) &PASS->LPOSC)                                 /* 0x409F0200 */
#define PASS_FIFO0                              ((PASS_FIFO_Type*) &PASS->FIFO[0])                                /* 0x409F0300 */
#define PASS_FIFO1                              ((PASS_FIFO_Type*) &PASS->FIFO[1])                                /* 0x409F0400 */
#define PASS_AREFV2                             ((PASS_AREFV2_Type*) &PASS->AREFV2)                               /* 0x409F0E00 */

/** \} PSoC6A256K */

#endif /* _PSOC6A256K_H_ */


/* [] END OF FILE */
